//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

//Console.WriteLine("Введите трёхзначное число, а программа покажет вторую цифру этого числа");
//int number = int.Parse(Console.ReadLine());
  
    
//        if (number >=100 && number < 1000)
//        {  
//           number = number / 10 ;
//           number = number % 10 ;
//           Console.WriteLine($"2 число = {number}");
//        }
        
//        else
//        {  
//        Console.WriteLine("вы ввели не трёхзначное число");
//        }

//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

//Console.WriteLine("Введите число, а программа покажет третью цифру этого числа");
//int number = int.Parse(Console.ReadLine());
  
        
//       if (number >=100)
//        {  
//          while(number > 999)
//           number = number / 10 ;
//           number = number % 10 ;
//           Console.WriteLine($"3 число = {number}");
//        }
        
//        else
//        {  
//        Console.WriteLine("вы ввели число где нет 3 цифры");
//        }


//Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
